[
    {
      "name": "Acolyte",
      "reasons": [
        "they ran away from home at an early age and found refuge in a temple.",
        "their family gave them to a temple, since they were unable or unwilling to care for them.",
        "they grew up in a household with strong religious convictions. Entering the service of one or more gods seemed natural.",
        "an impassioned sermon struck a chord deep in their soul and moved them to serve the faith.",
        "they followed a childhood friend, a respected acquaintance, or someone they loved into religious service.",
        "after encountering a true servant of the gods, they were so inspired that they immediately entered the service of a religious group."
      ]
    },
    {
      "name": "Charlatan",
      "reasons": [
        "they were left to their own devices, and their knack for manipulating others helped them survive.",
        "they learned early on that people are gullible and easy to exploit.",
        "they often got in trouble, but they managed to talk their way out of it every time.",
        "they took up with a confidence artist, from whom they learned their craft.",
        "after a charlatan fleeced their family, they decided to learn the trade so they would never be fooled by such deception again.",
        "they were poor or they feared becoming poor, so they learned the tricks they needed to keep theirself out of poverty."
      ]
    },
    {
      "name": "Criminal",
      "reasons": [
        "they resented authority in their younger days and saw a life of crime as the best way to fight against tyranny and oppression.",
        "necessity forced them to take up the life, since it was the only way they could survive.",
        "they fell in with a gang of reprobates and ne'er-do-wells, and they learned their specialty from them.",
        "a parent or relative taught they their criminal specialty to prepare them for the family business.",
        "they left home and found a place in a thieves' guild or some other criminal organization.",
        "they were always bored, so they turned to crime to pass the time and discovered they were quite good at it."
      ],
      "other": {
        "Criminal Specialty": [
          "Blackmailer",
          "Burglar",
          "Enforcer",
          "Fence",
          "Highway robber",
          "Hired killer",
          "Pickpocket",
          "Smuggler"
        ]
      }
    },
    {
      "name": "Entertainer",
      "reasons": [
        "members of their family made ends meet by performing, so it was fitting for them to follow their example.",
        "they always had a keen insight into other people, enough so that they could make them laugh or cry with their stories or songs.",
        "they ran away from home to follow a minstrel troupe.",
        "they saw a bard perform once, and they knew from that moment on what they were born to do.",
        "they earned coin by performing on street corners and eventually made a name for themself.",
        "a traveling entertainer took them in and taught them the trade."
      ],
      "other": {
        "Routine": [
          "Actor",
          "Dancer",
          "Fire-eater",
          "Jester",
          "Juggler",
          "Instrumentalist",
          "Poet",
          "Singer",
          "Storyteller",
          "Tumbler"
        ]
      }
    },
    {
      "name": "Folk Hero",
      "reasons": [
        "they learned what was right and wrong from their family.",
        "they were always enamored by tales of heroes and wished they could be something more than ordinary.",
        "they hated their mundane life, so when it was time for someone to step up and do the right thing, they took their chance.",
        "a parent or one of their relatives was an adventurer, and they were inspired by that person's courage.",
        "a mad old hermit spoke a prophecy when they were born, saying that they would accomplish great things.",
        "they have always stood up for those who are weaker than they are."
      ],
      "other": {
        "Defining Event": [
          "I stood up to a tyrant's agents.",
          "I saved people during a natural disaster.",
          "I stood alone against a terrible monster.",
          "I stole from a corrupt merchant to help the poor.",
          "I led a militia to fight off an invading artheir.",
          "I broke into a tyrant's castle and stole weapons to arm the people.",
          "I trained the peasantry to use farm implements as weapons against a tyrant's soldiers.",
          "A lord rescinded an unpopular decree after I led a symbolic act of protest against it.",
          "A celestial, fey, or similar creature gave me a blessing or revealed their secret origin.",
          "Recruited into a lord's artheir, I rose to leadership and was commended for their heroism."
        ]
      }
    },
    {
      "name": "Guild Artisan / Merchant",
      "reasons": [
        "they were apprenticed to a master who taught them the guild's business.",
        "they helped a guild artisan keep a secret or complete a task, and in return they were taken on as an apprentice.",
        "one of their family members who belonged to the guild made a place for them.",
        "they were always good with their hands, so they took the opportunity to learn a trade.",
        "they wanted to get away from their home situation and start a new life.",
        "they learned the essentials of their craft from a mentor but had to join the guild to finish their training."
      ],
      "other": {
        "Business": [
          "Alchemists and apothecaries",
          "Armorers, locksmiths, and fine-smiths",
          "Brewers, distillers, and vintners",
          "Calligraphers, scribes, and scriveners",
          "Carpenters, roofers, and plasterers",
          "Cartographers, surveyors, and chart-makers",
          "Cobblers and shoemakers",
          "Cooks and bakers",
          "Glassblowers and glaziers",
          "Jewelers and gem-cutters",
          "Leather-workers, skinners, and tanners",
          "Masons and stone-cutters",
          "Painters, liners, and sign-makers",
          "Potters and tile-makers",
          "Shipwrights and sail-makers",
          "Smiths and metal-forgers",
          "Tinkers, pewterers, and casters",
          "Wagon-makers and wheelwrights",
          "Weavers and dyers",
          "Woodcarvers, coopers, and bowyers"
        ]
      }
    },
    {
      "name": "Hermit",
      "reasons": [
        "their enemies ruined their reputation, and they fled to the wilds to avoid further disparagement.",
        "they are comfortable with being isolated, as they seek inner peace.",
        "they never liked the people they called their friends, so it was easy for they to strike out on their own.",
        "they felt compelled to forsake their past, but did so with great reluctance, and sometimes they regret making that decision.",
        "they lost everything - their home, their family, their friends. Going it alone was all they could do.",
        "society's decadence disgusted they, so they decided to leave it behind."
      ],
      "other": {
        "Life of Seclusion": [
          "I was searching for spiritual enlightenment.",
          "I was partaking of communal living in accordance with the dictates of a religious order.",
          "I was exiled for a crime I didn't commit.",
          "I retreated from society after a life-altering event.",
          "I needed a quiet place to work on their art, literature, music, or manifesto.",
          "I needed to commune with nature, far from civilization.",
          "I was the caretaker of an ancient ruin or relic.",
          "I was a pilgrim in search of a person, place, or relic of spiritual significance."
        ]
      }
    },
    {
      "name": "Noble",
      "reasons": [
        "they come from an old and storied family, and it fell to them to preserve the family name.",
        "their family has been disgraced, and they intend to clear their name.",
        "their family recently came by its title, and that elevation thrust they into a new and strange world.",
        "their family has a title, but none of their ancestors have distinguished themselves since they gained it.",
        "their family is filled with remarkable people, and they hope to live up to their example.",
        "they hope to increase their family's power and influence."
      ]
    },
    {
      "name": "Outlander",
      "reasons": [
        "they spent a lot of time in the wilderness as a youngster, and they came to love that way of life.",
        "from a young age, they couldn't abide the stink of the cities and preferred to spend their time in nature.",
        "they came to understand the darkness that lurks in the wilds, and they vowed to combat it.",
        "their people lived on the edges of civilization, and they learned the methods of survival from their family.",
        "after a tragedy, they retreated to the wilderness, leaving their old life behind.",
        "their family moved away from civilization, and they learned to adapt to their new environment."
      ],
      "other": {
        "Origin": [
          "Forester",
          "Trapper",
          "Homesteader",
          "Guide",
          "Exile or outcast",
          "Bounty hunter",
          "Pilgrim",
          "Tribal nomad",
          "Hunter-gatherer",
          "Tribal marauder"
        ]
      }
    },
    {
      "name": "Sage",
      "reasons": [
        "they were naturally curious, so they packed up and went to a university to learn more about the world.",
        "their mentor's teachings opened their mind to new possibilities in that field of study.",
        "they were always an avid reader, and they learned much about their favorite topic on their own.",
        "they discovered an old library and pored over the texts they found there. That experience awakened a hunger for more knowledge.",
        "they impressed a wizard who said they were squandering their talents and should seek out an education to take advantage of their gifts.",
        "one of their parents or a relative gave they a basic education that whetted their appetite, and they left home to build on what they had learned."
      ],
      "other": {
        "Specialty": [
          "Alchemist",
          "Astronomer",
          "Discredited academic",
          "Librarian",
          "Professor",
          "Researcher",
          "Wizard's apprentice",
          "Scribe"
        ]
      }
    },
    {
      "name": "Sailor",
      "reasons": [
        "they were press-ganged by pirates and forced to serve on their ship until they finally escaped.",
        "they wanted to see the world, so they signed on as a deckhand for a merchant ship.",
        "one of their relatives was a sailor who took them to sea.",
        "they needed to escape their community quickly, so they stowed away on a ship. When the crew found them, they were forced to work for their passage.",
        "reavers attacked their community, so they found refuge on a ship until they could seek vengeance.",
        "they had few prospects where they were living, so they left to find their fortune elsewhere."
      ]
    },
    {
      "name": "Soldier",
      "reasons": [
        "they joined the militia to help protect their community from monsters.",
        "a relative of theirs was a soldier, and they wanted to carry on the family tradition.",
        "the local lord forced them to enlist in the army.",
        "war ravaged their homeland while they were growing up. Fighting was the only life they ever knew.",
        "they wanted fame and fortune, so they joined a mercenary company, selling their sword to the highest bidder.",
        "invaders attacked their homeland. It was their duty to take up arms in defense of their people."
      ],
      "other": {
        "Position": [
          "Officer",
          "Scout",
          "Infantry",
          "Cavalry",
          "Healer",
          "Quartermaster",
          "Standard bearer",
          "Support staff (cook, blacksmith, or the like)"
        ]
      }
    },
    {
      "name": "Urchin",
      "reasons": [
        "wanderlust caused them to leave their family to see the world. They look after themselves.",
        "they ran away from a bad situation at home and made their own way in the world.",
        "monsters wiped out their village, and they were the sole survivor. They had to find a way to survive.",
        "a notorious thief looked after them and other orphans, and they spied and stole to earn their keep.",
        "one day they woke up on the streets, alone and hungry, with no memory of their early childhood.",
        "their parents died, leaving no one to look after they. They raised themselves."
      ]
    }
  ]